{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "source": [
        "#UE03 - SPARQL Query\n",
        "\n",
        "Please complete the 10 tasks in the `2. SPARQL` sheet of `SemAI.jar` first, and then transfer the task descriptions and your solutiosn in executable form to this notebook."
      ],
      "metadata": {
        "id": "PUyG1F1sVDEW"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "## Preparation\n",
        "\n",
        "Reuse imports and functions from https://github.com/jku-win-dke/SemAI/blob/main/V02_SPARQL.ipynb and load the solar system graph. Query the solar system graph to check that everything works fine. "
      ],
      "metadata": {
        "id": "Ky2HcjBHxqLp"
      }
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "RgRHkpEsLmx_",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 331
        },
        "outputId": "a65ed3d7-fd26-4d09-86b1-58132cf8b628"
      },
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "     planet   apoapsis apoapsis_uom\n",
              "0  :Mercury      0.467      unit:AU\n",
              "1    :Venus      0.728      unit:AU\n",
              "2    :Earth      1.017      unit:AU\n",
              "3    :Earth  149597871      unit:KM\n",
              "4     :Mars      1.666      unit:AU\n",
              "5  :Jupiter     5.4588      unit:AU\n",
              "6   :Saturn     9.0412      unit:AU\n",
              "7   :Uranus      20.11      unit:AU\n",
              "8  :Neptune      30.33      unit:AU"
            ],
            "text/html": [
              "\n",
              "  <div id=\"df-3de32218-85a4-44aa-b437-8dac9b9d0dcc\">\n",
              "    <div class=\"colab-df-container\">\n",
              "      <div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>planet</th>\n",
              "      <th>apoapsis</th>\n",
              "      <th>apoapsis_uom</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>:Mercury</td>\n",
              "      <td>0.467</td>\n",
              "      <td>unit:AU</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>:Venus</td>\n",
              "      <td>0.728</td>\n",
              "      <td>unit:AU</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>:Earth</td>\n",
              "      <td>1.017</td>\n",
              "      <td>unit:AU</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>:Earth</td>\n",
              "      <td>149597871</td>\n",
              "      <td>unit:KM</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>:Mars</td>\n",
              "      <td>1.666</td>\n",
              "      <td>unit:AU</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>5</th>\n",
              "      <td>:Jupiter</td>\n",
              "      <td>5.4588</td>\n",
              "      <td>unit:AU</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>6</th>\n",
              "      <td>:Saturn</td>\n",
              "      <td>9.0412</td>\n",
              "      <td>unit:AU</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>7</th>\n",
              "      <td>:Uranus</td>\n",
              "      <td>20.11</td>\n",
              "      <td>unit:AU</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>8</th>\n",
              "      <td>:Neptune</td>\n",
              "      <td>30.33</td>\n",
              "      <td>unit:AU</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>\n",
              "      <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-3de32218-85a4-44aa-b437-8dac9b9d0dcc')\"\n",
              "              title=\"Convert this dataframe to an interactive table.\"\n",
              "              style=\"display:none;\">\n",
              "        \n",
              "  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n",
              "       width=\"24px\">\n",
              "    <path d=\"M0 0h24v24H0V0z\" fill=\"none\"/>\n",
              "    <path d=\"M18.56 5.44l.94 2.06.94-2.06 2.06-.94-2.06-.94-.94-2.06-.94 2.06-2.06.94zm-11 1L8.5 8.5l.94-2.06 2.06-.94-2.06-.94L8.5 2.5l-.94 2.06-2.06.94zm10 10l.94 2.06.94-2.06 2.06-.94-2.06-.94-.94-2.06-.94 2.06-2.06.94z\"/><path d=\"M17.41 7.96l-1.37-1.37c-.4-.4-.92-.59-1.43-.59-.52 0-1.04.2-1.43.59L10.3 9.45l-7.72 7.72c-.78.78-.78 2.05 0 2.83L4 21.41c.39.39.9.59 1.41.59.51 0 1.02-.2 1.41-.59l7.78-7.78 2.81-2.81c.8-.78.8-2.07 0-2.86zM5.41 20L4 18.59l7.72-7.72 1.47 1.35L5.41 20z\"/>\n",
              "  </svg>\n",
              "      </button>\n",
              "      \n",
              "  <style>\n",
              "    .colab-df-container {\n",
              "      display:flex;\n",
              "      flex-wrap:wrap;\n",
              "      gap: 12px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert {\n",
              "      background-color: #E8F0FE;\n",
              "      border: none;\n",
              "      border-radius: 50%;\n",
              "      cursor: pointer;\n",
              "      display: none;\n",
              "      fill: #1967D2;\n",
              "      height: 32px;\n",
              "      padding: 0 0 0 0;\n",
              "      width: 32px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert:hover {\n",
              "      background-color: #E2EBFA;\n",
              "      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "      fill: #174EA6;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert {\n",
              "      background-color: #3B4455;\n",
              "      fill: #D2E3FC;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert:hover {\n",
              "      background-color: #434B5C;\n",
              "      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n",
              "      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n",
              "      fill: #FFFFFF;\n",
              "    }\n",
              "  </style>\n",
              "\n",
              "      <script>\n",
              "        const buttonEl =\n",
              "          document.querySelector('#df-3de32218-85a4-44aa-b437-8dac9b9d0dcc button.colab-df-convert');\n",
              "        buttonEl.style.display =\n",
              "          google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "\n",
              "        async function convertToInteractive(key) {\n",
              "          const element = document.querySelector('#df-3de32218-85a4-44aa-b437-8dac9b9d0dcc');\n",
              "          const dataTable =\n",
              "            await google.colab.kernel.invokeFunction('convertToInteractive',\n",
              "                                                     [key], {});\n",
              "          if (!dataTable) return;\n",
              "\n",
              "          const docLinkHtml = 'Like what you see? Visit the ' +\n",
              "            '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n",
              "            + ' to learn more about interactive tables.';\n",
              "          element.innerHTML = '';\n",
              "          dataTable['output_type'] = 'display_data';\n",
              "          await google.colab.output.renderOutput(dataTable, element);\n",
              "          const docLink = document.createElement('div');\n",
              "          docLink.innerHTML = docLinkHtml;\n",
              "          element.appendChild(docLink);\n",
              "        }\n",
              "      </script>\n",
              "    </div>\n",
              "  </div>\n",
              "  "
            ]
          },
          "metadata": {},
          "execution_count": 21
        }
      ],
      "source": [
        "# Install required packages\n",
        "!pip install -q rdflib\n",
        "!pip install -q pydot\n",
        "# Imports\n",
        "import pandas as pd\n",
        "from rdflib import Graph, Literal, RDF, URIRef, BNode, Namespace\n",
        "from rdflib.namespace import FOAF , XSD , RDFS, NamespaceManager \n",
        "from rdflib import Graph, Literal, RDF, URIRef, BNode, Namespace, Dataset\n",
        "from rdflib.namespace import FOAF , XSD , RDFS \n",
        "from IPython.display import Image\n",
        "import pydot\n",
        "from tabulate import tabulate\n",
        "\n",
        "# Convenient Functions\n",
        "def sparql_select(graph,query,use_prefixes=True):\n",
        "  results = graph.query(query)          # execute the query against the graph, resulting in a rdflib.plugins.sparql.processor.SPARQLResult\n",
        "  rows = []                             # a list of dictionaries, as intermediate format to construct the pandas DataFrame\n",
        "  for result in results:                # iterate over the result set of the query, a result is an instance of rdflib.query.ResultRow\n",
        "    row = {}                            #     create a dictionary to hold a single row of the result\n",
        "    for var in results.vars:            #     iterate over the variables of the SPARQLResult to add a dictionary entry for each variable\n",
        "      if (isinstance(result[var],URIRef) and use_prefixes):\n",
        "        row[var] = result[var].n3(graph.namespace_manager)   # use namespace prefixes to shorten URIs\n",
        "      else:\n",
        "        row[var] = result[var]                  \n",
        "    rows.append(row)                    #     add the dictionary (row) to the list \n",
        "  return pd.DataFrame(rows,columns=results.vars)        \n",
        "                                        # return a pandas DataFrame constructed from the list of dictionaries, with the variables from the result set as columns      \n",
        "\n",
        "def sparql_construct(graph, query):\n",
        "  result_graph = Graph(namespace_manager = g.namespace_manager)  # create a Graph object that reuses the namespace prefixes of the original graph\n",
        "  result_graph += graph.query(query)                             # execute the construct query against the original graph and add the resulting graph to the new one\n",
        "  return result_graph\n",
        "\n",
        "def sparql_ask(graph, query):\n",
        "  return bool(graph.query(query))      # an ASK query has a boolean result, which should be returned as such\n",
        "\n",
        "# Load solar system graph\n",
        "g = Graph()\n",
        "g.parse(\"https://raw.githubusercontent.com/jku-win-dke/SemAI/main/data/solarsystem.ttl\",format=\"turtle\")\n",
        "\n",
        "# Query solar system graph (to check that everything works fine)\n",
        "df = sparql_select(g,\"\"\"\n",
        "  SELECT ?planet ?apoapsis ?apoapsis_uom\n",
        "  WHERE { \n",
        "    ?planet rdf:type dbo:Planet . \n",
        "    OPTIONAL { ?planet v:apoapsis [rdf:value ?apoapsis ; v:uom ?apoapsis_uom ].  }\n",
        "  }\n",
        "\"\"\")\n",
        "df\n"
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "\n",
        "## Task 1 (1 pt)\n",
        "\n",
        "*TODO: add task description*"
      ],
      "metadata": {
        "id": "yRBr_COBQPQE"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "Geben Sie alle Zwergplaneten (Instanzen der Klasse dbo:DwarfPlanet) aus und falls vorhanden deren genaue Entsprechung (skos:exactMatch). Ordnen Sie das Ergebnis aufsteigend nach den URIs der Zwergplaneten."
      ],
      "metadata": {
        "id": "aC_iHmLiQkU_"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "\n"
      ],
      "metadata": {
        "id": "80JOXMi7NV2n"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "# TODO: include and execute the query, display the result\n",
        "df = sparql_select(g,\"\"\"\n",
        "base         <http://dke.jku.at/example/>\n",
        "prefix :     <http://dke.jku.at/example/solarsystem/>\n",
        "prefix v:    <http://dke.jku.at/example/examplevocabulary/>\n",
        "prefix rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
        "prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
        "prefix dbr:  <http://dbpedia.org/resource/>\n",
        "prefix dbo:  <http://dbpedia.org/ontology/>\n",
        "prefix dbd:\t <http://dbpedia.org/datatype/>\n",
        "prefix sdo:  <http://schema.org/>\n",
        "prefix wd:   <http://www.wikidata.org/entity/>\n",
        "prefix wdp:  <http://www.wikidata.org/prop/>\n",
        "prefix skos: <http://www.w3.org/2004/02/skos/core#>\n",
        "prefix unit: <http://qudt.org/vocab/unit/>\n",
        "prefix owl:  <http://www.w3.org/2002/07/owl#>\n",
        "\n",
        "SELECT *\n",
        "WHERE { ?d  rdf:type dbo:DwarfPlanet.\n",
        "OPTIONAL {?d skos:exactMatch ?match}\n",
        "}\n",
        "ORDER BY ?d\"\"\"\n",
        ",use_prefixes=False)\n",
        "df\n",
        "\n"
      ],
      "metadata": {
        "id": "0PE_ll0-MCdk",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 206
        },
        "outputId": "4340ad5b-6141-45bc-f2c9-072e99f8adda"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "                                 match  \\\n",
              "0  http://dbpedia.org/resource/1_Ceres   \n",
              "1                                 None   \n",
              "2                                 None   \n",
              "3                                 None   \n",
              "4    http://dbpedia.org/resource/Pluto   \n",
              "\n",
              "                                                d  \n",
              "0     http://dke.jku.at/example/solarsystem/Ceres  \n",
              "1      http://dke.jku.at/example/solarsystem/Eris  \n",
              "2    http://dke.jku.at/example/solarsystem/Haumea  \n",
              "3  http://dke.jku.at/example/solarsystem/Makemake  \n",
              "4     http://dke.jku.at/example/solarsystem/Pluto  "
            ],
            "text/html": [
              "\n",
              "  <div id=\"df-4d2c8b6a-dd7c-4d4b-9a4a-154e0bcb148f\">\n",
              "    <div class=\"colab-df-container\">\n",
              "      <div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>match</th>\n",
              "      <th>d</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>http://dbpedia.org/resource/1_Ceres</td>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Ceres</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>None</td>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Eris</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>None</td>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Haumea</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>None</td>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Makemake</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>http://dbpedia.org/resource/Pluto</td>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Pluto</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>\n",
              "      <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-4d2c8b6a-dd7c-4d4b-9a4a-154e0bcb148f')\"\n",
              "              title=\"Convert this dataframe to an interactive table.\"\n",
              "              style=\"display:none;\">\n",
              "        \n",
              "  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n",
              "       width=\"24px\">\n",
              "    <path d=\"M0 0h24v24H0V0z\" fill=\"none\"/>\n",
              "    <path d=\"M18.56 5.44l.94 2.06.94-2.06 2.06-.94-2.06-.94-.94-2.06-.94 2.06-2.06.94zm-11 1L8.5 8.5l.94-2.06 2.06-.94-2.06-.94L8.5 2.5l-.94 2.06-2.06.94zm10 10l.94 2.06.94-2.06 2.06-.94-2.06-.94-.94-2.06-.94 2.06-2.06.94z\"/><path d=\"M17.41 7.96l-1.37-1.37c-.4-.4-.92-.59-1.43-.59-.52 0-1.04.2-1.43.59L10.3 9.45l-7.72 7.72c-.78.78-.78 2.05 0 2.83L4 21.41c.39.39.9.59 1.41.59.51 0 1.02-.2 1.41-.59l7.78-7.78 2.81-2.81c.8-.78.8-2.07 0-2.86zM5.41 20L4 18.59l7.72-7.72 1.47 1.35L5.41 20z\"/>\n",
              "  </svg>\n",
              "      </button>\n",
              "      \n",
              "  <style>\n",
              "    .colab-df-container {\n",
              "      display:flex;\n",
              "      flex-wrap:wrap;\n",
              "      gap: 12px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert {\n",
              "      background-color: #E8F0FE;\n",
              "      border: none;\n",
              "      border-radius: 50%;\n",
              "      cursor: pointer;\n",
              "      display: none;\n",
              "      fill: #1967D2;\n",
              "      height: 32px;\n",
              "      padding: 0 0 0 0;\n",
              "      width: 32px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert:hover {\n",
              "      background-color: #E2EBFA;\n",
              "      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "      fill: #174EA6;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert {\n",
              "      background-color: #3B4455;\n",
              "      fill: #D2E3FC;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert:hover {\n",
              "      background-color: #434B5C;\n",
              "      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n",
              "      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n",
              "      fill: #FFFFFF;\n",
              "    }\n",
              "  </style>\n",
              "\n",
              "      <script>\n",
              "        const buttonEl =\n",
              "          document.querySelector('#df-4d2c8b6a-dd7c-4d4b-9a4a-154e0bcb148f button.colab-df-convert');\n",
              "        buttonEl.style.display =\n",
              "          google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "\n",
              "        async function convertToInteractive(key) {\n",
              "          const element = document.querySelector('#df-4d2c8b6a-dd7c-4d4b-9a4a-154e0bcb148f');\n",
              "          const dataTable =\n",
              "            await google.colab.kernel.invokeFunction('convertToInteractive',\n",
              "                                                     [key], {});\n",
              "          if (!dataTable) return;\n",
              "\n",
              "          const docLinkHtml = 'Like what you see? Visit the ' +\n",
              "            '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n",
              "            + ' to learn more about interactive tables.';\n",
              "          element.innerHTML = '';\n",
              "          dataTable['output_type'] = 'display_data';\n",
              "          await google.colab.output.renderOutput(dataTable, element);\n",
              "          const docLink = document.createElement('div');\n",
              "          docLink.innerHTML = docLinkHtml;\n",
              "          element.appendChild(docLink);\n",
              "        }\n",
              "      </script>\n",
              "    </div>\n",
              "  </div>\n",
              "  "
            ]
          },
          "metadata": {},
          "execution_count": 35
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "## Task 2 (1 pt)\n",
        "\n",
        "*TODO: add task description*"
      ],
      "metadata": {
        "id": "YVzpX0ExF6wO"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "Ermitteln Sie alle Sterne, ihr exactMatch, und ihre Masse (geben Sie den Wert und die Maßeinheit aus). Ordnen Sie das Ergebnis nach der URI der Sterne"
      ],
      "metadata": {
        "id": "o1g151_BTATS"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "# TODO: include and execute the query, display the result"
      ],
      "metadata": {
        "id": "j82TeG59F6wP"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "df = sparql_select(g,\"\"\" \n",
        "base         <http://dke.jku.at/example/>\n",
        "prefix :     <http://dke.jku.at/example/solarsystem/>\n",
        "prefix v:    <http://dke.jku.at/example/examplevocabulary/>\n",
        "prefix rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
        "prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
        "prefix dbr:  <http://dbpedia.org/resource/>\n",
        "prefix dbo:  <http://dbpedia.org/ontology/>\n",
        "prefix dbd:\t <http://dbpedia.org/datatype/>\n",
        "prefix sdo:  <http://schema.org/>\n",
        "prefix wd:   <http://www.wikidata.org/entity/>\n",
        "prefix wdp:  <http://www.wikidata.org/prop/>\n",
        "prefix skos: <http://www.w3.org/2004/02/skos/core#>\n",
        "prefix unit: <http://qudt.org/vocab/unit/>\n",
        "prefix owl:  <http://www.w3.org/2002/07/owl#>\n",
        "\n",
        "SELECT *\n",
        "WHERE { ?star rdf:type dbo:Star.\n",
        "OPTIONAL {?star skos:exactMatch ?match}\n",
        "OPTIONAL {?star v:mass[rdf:value ?massVal; v:uom ?massUoM]}\n",
        " }\n",
        "ORDER BY ?star\"\"\"\n",
        ",use_prefixes=False)\n",
        "df"
      ],
      "metadata": {
        "id": "uzVhRt_eTCTS",
        "outputId": "cbab136d-ce55-4366-f45d-2abee1d242fd",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 174
        }
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "                                                star  \\\n",
              "0  http://dke.jku.at/example/solarsystem/AlphaCen...   \n",
              "1  http://dke.jku.at/example/solarsystem/AlphaCen...   \n",
              "2  http://dke.jku.at/example/solarsystem/ProximaC...   \n",
              "3          http://dke.jku.at/example/solarsystem/Sun   \n",
              "\n",
              "                                     match     massVal  \\\n",
              "0  http://www.wikidata.org/entity/Q2090157         1.1   \n",
              "1  http://www.wikidata.org/entity/Q1052548         0.9   \n",
              "2    http://www.wikidata.org/entity/Q14266      0.1221   \n",
              "3          http://dbpedia.org/resource/Sun  1.9884e+30   \n",
              "\n",
              "                                             massUoM  \n",
              "0  http://dke.jku.at/example/examplevocabulary/So...  \n",
              "1  http://dke.jku.at/example/examplevocabulary/So...  \n",
              "2  http://dke.jku.at/example/examplevocabulary/So...  \n",
              "3                      http://qudt.org/vocab/unit/KG  "
            ],
            "text/html": [
              "\n",
              "  <div id=\"df-37ecdf8a-33d8-43fe-b98c-62f9d1a62dbd\">\n",
              "    <div class=\"colab-df-container\">\n",
              "      <div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>star</th>\n",
              "      <th>match</th>\n",
              "      <th>massVal</th>\n",
              "      <th>massUoM</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>http://dke.jku.at/example/solarsystem/AlphaCen...</td>\n",
              "      <td>http://www.wikidata.org/entity/Q2090157</td>\n",
              "      <td>1.1</td>\n",
              "      <td>http://dke.jku.at/example/examplevocabulary/So...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>http://dke.jku.at/example/solarsystem/AlphaCen...</td>\n",
              "      <td>http://www.wikidata.org/entity/Q1052548</td>\n",
              "      <td>0.9</td>\n",
              "      <td>http://dke.jku.at/example/examplevocabulary/So...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>http://dke.jku.at/example/solarsystem/ProximaC...</td>\n",
              "      <td>http://www.wikidata.org/entity/Q14266</td>\n",
              "      <td>0.1221</td>\n",
              "      <td>http://dke.jku.at/example/examplevocabulary/So...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Sun</td>\n",
              "      <td>http://dbpedia.org/resource/Sun</td>\n",
              "      <td>1.9884e+30</td>\n",
              "      <td>http://qudt.org/vocab/unit/KG</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>\n",
              "      <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-37ecdf8a-33d8-43fe-b98c-62f9d1a62dbd')\"\n",
              "              title=\"Convert this dataframe to an interactive table.\"\n",
              "              style=\"display:none;\">\n",
              "        \n",
              "  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n",
              "       width=\"24px\">\n",
              "    <path d=\"M0 0h24v24H0V0z\" fill=\"none\"/>\n",
              "    <path d=\"M18.56 5.44l.94 2.06.94-2.06 2.06-.94-2.06-.94-.94-2.06-.94 2.06-2.06.94zm-11 1L8.5 8.5l.94-2.06 2.06-.94-2.06-.94L8.5 2.5l-.94 2.06-2.06.94zm10 10l.94 2.06.94-2.06 2.06-.94-2.06-.94-.94-2.06-.94 2.06-2.06.94z\"/><path d=\"M17.41 7.96l-1.37-1.37c-.4-.4-.92-.59-1.43-.59-.52 0-1.04.2-1.43.59L10.3 9.45l-7.72 7.72c-.78.78-.78 2.05 0 2.83L4 21.41c.39.39.9.59 1.41.59.51 0 1.02-.2 1.41-.59l7.78-7.78 2.81-2.81c.8-.78.8-2.07 0-2.86zM5.41 20L4 18.59l7.72-7.72 1.47 1.35L5.41 20z\"/>\n",
              "  </svg>\n",
              "      </button>\n",
              "      \n",
              "  <style>\n",
              "    .colab-df-container {\n",
              "      display:flex;\n",
              "      flex-wrap:wrap;\n",
              "      gap: 12px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert {\n",
              "      background-color: #E8F0FE;\n",
              "      border: none;\n",
              "      border-radius: 50%;\n",
              "      cursor: pointer;\n",
              "      display: none;\n",
              "      fill: #1967D2;\n",
              "      height: 32px;\n",
              "      padding: 0 0 0 0;\n",
              "      width: 32px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert:hover {\n",
              "      background-color: #E2EBFA;\n",
              "      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "      fill: #174EA6;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert {\n",
              "      background-color: #3B4455;\n",
              "      fill: #D2E3FC;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert:hover {\n",
              "      background-color: #434B5C;\n",
              "      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n",
              "      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n",
              "      fill: #FFFFFF;\n",
              "    }\n",
              "  </style>\n",
              "\n",
              "      <script>\n",
              "        const buttonEl =\n",
              "          document.querySelector('#df-37ecdf8a-33d8-43fe-b98c-62f9d1a62dbd button.colab-df-convert');\n",
              "        buttonEl.style.display =\n",
              "          google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "\n",
              "        async function convertToInteractive(key) {\n",
              "          const element = document.querySelector('#df-37ecdf8a-33d8-43fe-b98c-62f9d1a62dbd');\n",
              "          const dataTable =\n",
              "            await google.colab.kernel.invokeFunction('convertToInteractive',\n",
              "                                                     [key], {});\n",
              "          if (!dataTable) return;\n",
              "\n",
              "          const docLinkHtml = 'Like what you see? Visit the ' +\n",
              "            '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n",
              "            + ' to learn more about interactive tables.';\n",
              "          element.innerHTML = '';\n",
              "          dataTable['output_type'] = 'display_data';\n",
              "          await google.colab.output.renderOutput(dataTable, element);\n",
              "          const docLink = document.createElement('div');\n",
              "          docLink.innerHTML = docLinkHtml;\n",
              "          element.appendChild(docLink);\n",
              "        }\n",
              "      </script>\n",
              "    </div>\n",
              "  </div>\n",
              "  "
            ]
          },
          "metadata": {},
          "execution_count": 34
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "## Task 3 (1 pt)\n",
        "\n",
        "*TODO: add task description*"
      ],
      "metadata": {
        "id": "3i2B2tLRF7T3"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "Die Planeten unseres Sonnensystems und ihre jeweilige Anzahl an Monden. Unterscheiden Sie die im RDF-Graph beschriebenen Monde und die im RDF-Graph erfasste Anzahl von Monden. Sortieren Sie nach den Planeten."
      ],
      "metadata": {
        "id": "qY3thWtkTRnC"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "# TODO: include and execute the query, display the result"
      ],
      "metadata": {
        "id": "uZVUV577F7T4"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "df = sparql_select(g,\"\"\" \n",
        "base         <http://dke.jku.at/example/>\n",
        "prefix :     <http://dke.jku.at/example/solarsystem/>\n",
        "prefix v:    <http://dke.jku.at/example/examplevocabulary/>\n",
        "prefix rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
        "prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
        "prefix dbr:  <http://dbpedia.org/resource/>\n",
        "prefix dbo:  <http://dbpedia.org/ontology/>\n",
        "prefix dbd:\t <http://dbpedia.org/datatype/>\n",
        "prefix sdo:  <http://schema.org/>\n",
        "prefix wd:   <http://www.wikidata.org/entity/>\n",
        "prefix wdp:  <http://www.wikidata.org/prop/>\n",
        "prefix skos: <http://www.w3.org/2004/02/skos/core#>\n",
        "prefix unit: <http://qudt.org/vocab/unit/>\n",
        "prefix owl:  <http://www.w3.org/2002/07/owl#>\n",
        "\n",
        "SELECT ?planet ?assertedNo(COUNT(?moon) AS ?noOfDescribedMoons)  \n",
        "WHERE { ?planet rdf:type dbo:Planet; v:nrOfMoons ?assertedNo.\n",
        "OPTIONAL { ?moon v:orbits ?planet.}      \n",
        "      }\n",
        "GROUP BY ?planet ?assertedNo\n",
        "ORDER BY ?planet\"\"\"\n",
        ",use_prefixes=False)\n",
        "df"
      ],
      "metadata": {
        "id": "0rRXrZ4NTT1W",
        "outputId": "72ed16a0-c15e-4ebf-b83f-ad71942e4901",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 300
        }
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "                                          planet assertedNo noOfDescribedMoons\n",
              "0    http://dke.jku.at/example/solarsystem/Earth          1                  1\n",
              "1  http://dke.jku.at/example/solarsystem/Jupiter         79                  4\n",
              "2     http://dke.jku.at/example/solarsystem/Mars          2                  2\n",
              "3  http://dke.jku.at/example/solarsystem/Mercury          0                  0\n",
              "4  http://dke.jku.at/example/solarsystem/Neptune         14                  0\n",
              "5   http://dke.jku.at/example/solarsystem/Saturn         82                  2\n",
              "6   http://dke.jku.at/example/solarsystem/Uranus         27                  0\n",
              "7    http://dke.jku.at/example/solarsystem/Venus          0                  0"
            ],
            "text/html": [
              "\n",
              "  <div id=\"df-c72c200c-8bc1-4226-8fe2-787cd9deb5e5\">\n",
              "    <div class=\"colab-df-container\">\n",
              "      <div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>planet</th>\n",
              "      <th>assertedNo</th>\n",
              "      <th>noOfDescribedMoons</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Earth</td>\n",
              "      <td>1</td>\n",
              "      <td>1</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Jupiter</td>\n",
              "      <td>79</td>\n",
              "      <td>4</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Mars</td>\n",
              "      <td>2</td>\n",
              "      <td>2</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Mercury</td>\n",
              "      <td>0</td>\n",
              "      <td>0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Neptune</td>\n",
              "      <td>14</td>\n",
              "      <td>0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>5</th>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Saturn</td>\n",
              "      <td>82</td>\n",
              "      <td>2</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>6</th>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Uranus</td>\n",
              "      <td>27</td>\n",
              "      <td>0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>7</th>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Venus</td>\n",
              "      <td>0</td>\n",
              "      <td>0</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>\n",
              "      <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-c72c200c-8bc1-4226-8fe2-787cd9deb5e5')\"\n",
              "              title=\"Convert this dataframe to an interactive table.\"\n",
              "              style=\"display:none;\">\n",
              "        \n",
              "  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n",
              "       width=\"24px\">\n",
              "    <path d=\"M0 0h24v24H0V0z\" fill=\"none\"/>\n",
              "    <path d=\"M18.56 5.44l.94 2.06.94-2.06 2.06-.94-2.06-.94-.94-2.06-.94 2.06-2.06.94zm-11 1L8.5 8.5l.94-2.06 2.06-.94-2.06-.94L8.5 2.5l-.94 2.06-2.06.94zm10 10l.94 2.06.94-2.06 2.06-.94-2.06-.94-.94-2.06-.94 2.06-2.06.94z\"/><path d=\"M17.41 7.96l-1.37-1.37c-.4-.4-.92-.59-1.43-.59-.52 0-1.04.2-1.43.59L10.3 9.45l-7.72 7.72c-.78.78-.78 2.05 0 2.83L4 21.41c.39.39.9.59 1.41.59.51 0 1.02-.2 1.41-.59l7.78-7.78 2.81-2.81c.8-.78.8-2.07 0-2.86zM5.41 20L4 18.59l7.72-7.72 1.47 1.35L5.41 20z\"/>\n",
              "  </svg>\n",
              "      </button>\n",
              "      \n",
              "  <style>\n",
              "    .colab-df-container {\n",
              "      display:flex;\n",
              "      flex-wrap:wrap;\n",
              "      gap: 12px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert {\n",
              "      background-color: #E8F0FE;\n",
              "      border: none;\n",
              "      border-radius: 50%;\n",
              "      cursor: pointer;\n",
              "      display: none;\n",
              "      fill: #1967D2;\n",
              "      height: 32px;\n",
              "      padding: 0 0 0 0;\n",
              "      width: 32px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert:hover {\n",
              "      background-color: #E2EBFA;\n",
              "      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "      fill: #174EA6;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert {\n",
              "      background-color: #3B4455;\n",
              "      fill: #D2E3FC;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert:hover {\n",
              "      background-color: #434B5C;\n",
              "      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n",
              "      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n",
              "      fill: #FFFFFF;\n",
              "    }\n",
              "  </style>\n",
              "\n",
              "      <script>\n",
              "        const buttonEl =\n",
              "          document.querySelector('#df-c72c200c-8bc1-4226-8fe2-787cd9deb5e5 button.colab-df-convert');\n",
              "        buttonEl.style.display =\n",
              "          google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "\n",
              "        async function convertToInteractive(key) {\n",
              "          const element = document.querySelector('#df-c72c200c-8bc1-4226-8fe2-787cd9deb5e5');\n",
              "          const dataTable =\n",
              "            await google.colab.kernel.invokeFunction('convertToInteractive',\n",
              "                                                     [key], {});\n",
              "          if (!dataTable) return;\n",
              "\n",
              "          const docLinkHtml = 'Like what you see? Visit the ' +\n",
              "            '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n",
              "            + ' to learn more about interactive tables.';\n",
              "          element.innerHTML = '';\n",
              "          dataTable['output_type'] = 'display_data';\n",
              "          await google.colab.output.renderOutput(dataTable, element);\n",
              "          const docLink = document.createElement('div');\n",
              "          docLink.innerHTML = docLinkHtml;\n",
              "          element.appendChild(docLink);\n",
              "        }\n",
              "      </script>\n",
              "    </div>\n",
              "  </div>\n",
              "  "
            ]
          },
          "metadata": {},
          "execution_count": 36
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [],
      "metadata": {
        "id": "UIrAFQZVTSxA"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "## Task 4 (1 pt)\n",
        "\n",
        "*TODO: add task description*"
      ],
      "metadata": {
        "id": "OEx2sM7nF7n2"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "Ermitteln sie für die Planeten in unserem Sonnensystem die durchschnittliche Anzahl an Monden (die auch im RDF-Graph beschrieben sind) pro Planet."
      ],
      "metadata": {
        "id": "NmgsSSR9Tlpi"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "df = sparql_select(g,\"\"\" \n",
        "base         <http://dke.jku.at/example/>\n",
        "prefix :     <http://dke.jku.at/example/solarsystem/>\n",
        "prefix v:    <http://dke.jku.at/example/examplevocabulary/>\n",
        "prefix rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
        "prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
        "prefix dbr:  <http://dbpedia.org/resource/>\n",
        "prefix dbo:  <http://dbpedia.org/ontology/>\n",
        "prefix dbd:\t <http://dbpedia.org/datatype/>\n",
        "prefix sdo:  <http://schema.org/>\n",
        "prefix wd:   <http://www.wikidata.org/entity/>\n",
        "prefix wdp:  <http://www.wikidata.org/prop/>\n",
        "prefix skos: <http://www.w3.org/2004/02/skos/core#>\n",
        "prefix unit: <http://qudt.org/vocab/unit/>\n",
        "prefix owl:  <http://www.w3.org/2002/07/owl#>\n",
        "\n",
        "SELECT (AVG(?moons) AS ?avgNoOfDescribedMoons)\n",
        "WHERE { \n",
        "SELECT (COUNT (?moon) AS ?moons)\n",
        "WHERE { ?planet rdf:type dbo:Planet; v:orbits :Sun.\n",
        "OPTIONAL {?moon rdf:type dbo:Satellite; \n",
        "                v:orbits ?planet. }\n",
        "}\n",
        "Group by ?planet \n",
        "}\"\"\"\n",
        ",use_prefixes=False)\n",
        "df"
      ],
      "metadata": {
        "id": "aLirjLgDTmIj",
        "outputId": "50cecbc7-c81d-40d7-8020-607a66e8974b",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 80
        }
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "  avgNoOfDescribedMoons\n",
              "0                 1.125"
            ],
            "text/html": [
              "\n",
              "  <div id=\"df-a7961719-9b20-4ec6-9559-317a4be70cd4\">\n",
              "    <div class=\"colab-df-container\">\n",
              "      <div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>avgNoOfDescribedMoons</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>1.125</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>\n",
              "      <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-a7961719-9b20-4ec6-9559-317a4be70cd4')\"\n",
              "              title=\"Convert this dataframe to an interactive table.\"\n",
              "              style=\"display:none;\">\n",
              "        \n",
              "  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n",
              "       width=\"24px\">\n",
              "    <path d=\"M0 0h24v24H0V0z\" fill=\"none\"/>\n",
              "    <path d=\"M18.56 5.44l.94 2.06.94-2.06 2.06-.94-2.06-.94-.94-2.06-.94 2.06-2.06.94zm-11 1L8.5 8.5l.94-2.06 2.06-.94-2.06-.94L8.5 2.5l-.94 2.06-2.06.94zm10 10l.94 2.06.94-2.06 2.06-.94-2.06-.94-.94-2.06-.94 2.06-2.06.94z\"/><path d=\"M17.41 7.96l-1.37-1.37c-.4-.4-.92-.59-1.43-.59-.52 0-1.04.2-1.43.59L10.3 9.45l-7.72 7.72c-.78.78-.78 2.05 0 2.83L4 21.41c.39.39.9.59 1.41.59.51 0 1.02-.2 1.41-.59l7.78-7.78 2.81-2.81c.8-.78.8-2.07 0-2.86zM5.41 20L4 18.59l7.72-7.72 1.47 1.35L5.41 20z\"/>\n",
              "  </svg>\n",
              "      </button>\n",
              "      \n",
              "  <style>\n",
              "    .colab-df-container {\n",
              "      display:flex;\n",
              "      flex-wrap:wrap;\n",
              "      gap: 12px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert {\n",
              "      background-color: #E8F0FE;\n",
              "      border: none;\n",
              "      border-radius: 50%;\n",
              "      cursor: pointer;\n",
              "      display: none;\n",
              "      fill: #1967D2;\n",
              "      height: 32px;\n",
              "      padding: 0 0 0 0;\n",
              "      width: 32px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert:hover {\n",
              "      background-color: #E2EBFA;\n",
              "      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "      fill: #174EA6;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert {\n",
              "      background-color: #3B4455;\n",
              "      fill: #D2E3FC;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert:hover {\n",
              "      background-color: #434B5C;\n",
              "      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n",
              "      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n",
              "      fill: #FFFFFF;\n",
              "    }\n",
              "  </style>\n",
              "\n",
              "      <script>\n",
              "        const buttonEl =\n",
              "          document.querySelector('#df-a7961719-9b20-4ec6-9559-317a4be70cd4 button.colab-df-convert');\n",
              "        buttonEl.style.display =\n",
              "          google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "\n",
              "        async function convertToInteractive(key) {\n",
              "          const element = document.querySelector('#df-a7961719-9b20-4ec6-9559-317a4be70cd4');\n",
              "          const dataTable =\n",
              "            await google.colab.kernel.invokeFunction('convertToInteractive',\n",
              "                                                     [key], {});\n",
              "          if (!dataTable) return;\n",
              "\n",
              "          const docLinkHtml = 'Like what you see? Visit the ' +\n",
              "            '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n",
              "            + ' to learn more about interactive tables.';\n",
              "          element.innerHTML = '';\n",
              "          dataTable['output_type'] = 'display_data';\n",
              "          await google.colab.output.renderOutput(dataTable, element);\n",
              "          const docLink = document.createElement('div');\n",
              "          docLink.innerHTML = docLinkHtml;\n",
              "          element.appendChild(docLink);\n",
              "        }\n",
              "      </script>\n",
              "    </div>\n",
              "  </div>\n",
              "  "
            ]
          },
          "metadata": {},
          "execution_count": 37
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# TODO: include and execute the query, display the result"
      ],
      "metadata": {
        "id": "1kk9dlZAF7n3"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "## Task 5 (1 pt)\n",
        "\n",
        "*TODO: add task description*"
      ],
      "metadata": {
        "id": "1nGGo4_XF70X"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "Geben Sie die im RDF-Graph verwendeten Klassen und ihre Anzahl an Instanzen aus. Geben Sie nur Klassen mit mindestens 2 Instanzen aus. Ordnen Sie die Ausgabe nach der URI der Klassen"
      ],
      "metadata": {
        "id": "xCiUJrLtTxmo"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "df = sparql_select(g,\"\"\"\n",
        "base         <http://dke.jku.at/example/>\n",
        "prefix :     <http://dke.jku.at/example/solarsystem/>\n",
        "prefix v:    <http://dke.jku.at/example/examplevocabulary/>\n",
        "prefix rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
        "prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
        "prefix dbr:  <http://dbpedia.org/resource/>\n",
        "prefix dbo:  <http://dbpedia.org/ontology/>\n",
        "prefix dbd:\t <http://dbpedia.org/datatype/>\n",
        "prefix sdo:  <http://schema.org/>\n",
        "prefix wd:   <http://www.wikidata.org/entity/>\n",
        "prefix wdp:  <http://www.wikidata.org/prop/>\n",
        "prefix skos: <http://www.w3.org/2004/02/skos/core#>\n",
        "prefix unit: <http://qudt.org/vocab/unit/>\n",
        "prefix owl:  <http://www.w3.org/2002/07/owl#>\n",
        "\n",
        "SELECT ?class ?noOfInstances\n",
        "WHERE{\n",
        "{\n",
        "SELECT (COUNT (?subject) AS ?noOfInstances) ?class\n",
        "WHERE { ?subject rdf:type ?class. }\n",
        "Group by ?class\n",
        "}\n",
        "Filter(?noOfInstances > 2) }\n",
        "ORDER BY ?class\"\"\"\n",
        ",use_prefixes=False)\n",
        "df"
      ],
      "metadata": {
        "id": "mHfA7I8lT2v_",
        "outputId": "d18a2ae4-644c-4d43-c7e1-a85b2de2e020",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 174
        }
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "                                     class noOfInstances\n",
              "0  http://dbpedia.org/ontology/DwarfPlanet             5\n",
              "1       http://dbpedia.org/ontology/Planet             8\n",
              "2    http://dbpedia.org/ontology/Satellite             9\n",
              "3         http://dbpedia.org/ontology/Star             4"
            ],
            "text/html": [
              "\n",
              "  <div id=\"df-73c2d358-40e9-483c-89c6-d0e3a6ade3b3\">\n",
              "    <div class=\"colab-df-container\">\n",
              "      <div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>class</th>\n",
              "      <th>noOfInstances</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>http://dbpedia.org/ontology/DwarfPlanet</td>\n",
              "      <td>5</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>http://dbpedia.org/ontology/Planet</td>\n",
              "      <td>8</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>http://dbpedia.org/ontology/Satellite</td>\n",
              "      <td>9</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>http://dbpedia.org/ontology/Star</td>\n",
              "      <td>4</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>\n",
              "      <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-73c2d358-40e9-483c-89c6-d0e3a6ade3b3')\"\n",
              "              title=\"Convert this dataframe to an interactive table.\"\n",
              "              style=\"display:none;\">\n",
              "        \n",
              "  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n",
              "       width=\"24px\">\n",
              "    <path d=\"M0 0h24v24H0V0z\" fill=\"none\"/>\n",
              "    <path d=\"M18.56 5.44l.94 2.06.94-2.06 2.06-.94-2.06-.94-.94-2.06-.94 2.06-2.06.94zm-11 1L8.5 8.5l.94-2.06 2.06-.94-2.06-.94L8.5 2.5l-.94 2.06-2.06.94zm10 10l.94 2.06.94-2.06 2.06-.94-2.06-.94-.94-2.06-.94 2.06-2.06.94z\"/><path d=\"M17.41 7.96l-1.37-1.37c-.4-.4-.92-.59-1.43-.59-.52 0-1.04.2-1.43.59L10.3 9.45l-7.72 7.72c-.78.78-.78 2.05 0 2.83L4 21.41c.39.39.9.59 1.41.59.51 0 1.02-.2 1.41-.59l7.78-7.78 2.81-2.81c.8-.78.8-2.07 0-2.86zM5.41 20L4 18.59l7.72-7.72 1.47 1.35L5.41 20z\"/>\n",
              "  </svg>\n",
              "      </button>\n",
              "      \n",
              "  <style>\n",
              "    .colab-df-container {\n",
              "      display:flex;\n",
              "      flex-wrap:wrap;\n",
              "      gap: 12px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert {\n",
              "      background-color: #E8F0FE;\n",
              "      border: none;\n",
              "      border-radius: 50%;\n",
              "      cursor: pointer;\n",
              "      display: none;\n",
              "      fill: #1967D2;\n",
              "      height: 32px;\n",
              "      padding: 0 0 0 0;\n",
              "      width: 32px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert:hover {\n",
              "      background-color: #E2EBFA;\n",
              "      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "      fill: #174EA6;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert {\n",
              "      background-color: #3B4455;\n",
              "      fill: #D2E3FC;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert:hover {\n",
              "      background-color: #434B5C;\n",
              "      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n",
              "      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n",
              "      fill: #FFFFFF;\n",
              "    }\n",
              "  </style>\n",
              "\n",
              "      <script>\n",
              "        const buttonEl =\n",
              "          document.querySelector('#df-73c2d358-40e9-483c-89c6-d0e3a6ade3b3 button.colab-df-convert');\n",
              "        buttonEl.style.display =\n",
              "          google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "\n",
              "        async function convertToInteractive(key) {\n",
              "          const element = document.querySelector('#df-73c2d358-40e9-483c-89c6-d0e3a6ade3b3');\n",
              "          const dataTable =\n",
              "            await google.colab.kernel.invokeFunction('convertToInteractive',\n",
              "                                                     [key], {});\n",
              "          if (!dataTable) return;\n",
              "\n",
              "          const docLinkHtml = 'Like what you see? Visit the ' +\n",
              "            '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n",
              "            + ' to learn more about interactive tables.';\n",
              "          element.innerHTML = '';\n",
              "          dataTable['output_type'] = 'display_data';\n",
              "          await google.colab.output.renderOutput(dataTable, element);\n",
              "          const docLink = document.createElement('div');\n",
              "          docLink.innerHTML = docLinkHtml;\n",
              "          element.appendChild(docLink);\n",
              "        }\n",
              "      </script>\n",
              "    </div>\n",
              "  </div>\n",
              "  "
            ]
          },
          "metadata": {},
          "execution_count": 38
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# TODO: include and execute the query, display the result"
      ],
      "metadata": {
        "id": "AxB2DcY-F70Y"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "## Task 6 (1 pt)\n",
        "\n",
        "*TODO: add task description*"
      ],
      "metadata": {
        "id": "nB_ZOGV9F7_v"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "# TODO: include and execute the query, display the result"
      ],
      "metadata": {
        "id": "x4uW2B4dF7_w"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "## Task 7 (1 pt)\n",
        "\n",
        "*TODO: add task description*"
      ],
      "metadata": {
        "id": "nXPqBOZjF8LH"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "Ermitteln Sie alle Sterne, sowie alle Monde. Zu jedem Mond ermitteln Sie auch den Planet, den dieser Mond umrundet. Ordnen Sie die Ausgabe nach der URI der Sterne und Monde."
      ],
      "metadata": {
        "id": "X40B7M6OT_Pf"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "# TODO: include and execute the query, display the result"
      ],
      "metadata": {
        "id": "rDqaQlDhF8LI"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "df = sparql_select(g,\"\"\"\n",
        "base         <http://dke.jku.at/example/>\n",
        "prefix :     <http://dke.jku.at/example/solarsystem/>\n",
        "prefix v:    <http://dke.jku.at/example/examplevocabulary/>\n",
        "prefix rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
        "prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
        "prefix dbr:  <http://dbpedia.org/resource/>\n",
        "prefix dbo:  <http://dbpedia.org/ontology/>\n",
        "prefix dbd:\t <http://dbpedia.org/datatype/>\n",
        "prefix sdo:  <http://schema.org/>\n",
        "prefix wd:   <http://www.wikidata.org/entity/>\n",
        "prefix wdp:  <http://www.wikidata.org/prop/>\n",
        "prefix skos: <http://www.w3.org/2004/02/skos/core#>\n",
        "prefix unit: <http://qudt.org/vocab/unit/>\n",
        "prefix owl:  <http://www.w3.org/2002/07/owl#>\n",
        "\n",
        "SELECT *\n",
        "WHERE {  {?x rdf:type dbo:Star}\n",
        "      UNION \n",
        "       {?x rdf:type dbo:Satellite}\n",
        "        OPTIONAL {?x v:orbits ?y } \n",
        "     }\n",
        "ORDER BY ?x\"\"\"\n",
        ",use_prefixes=False)\n",
        "df"
      ],
      "metadata": {
        "id": "hqnPfqOUUDVS",
        "outputId": "f1072e42-15d5-4c74-fb15-f5ff0e3ebcf3",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 457
        }
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "                                                    x  \\\n",
              "0   http://dke.jku.at/example/solarsystem/AlphaCen...   \n",
              "1   http://dke.jku.at/example/solarsystem/AlphaCen...   \n",
              "2      http://dke.jku.at/example/solarsystem/Callisto   \n",
              "3        http://dke.jku.at/example/solarsystem/Deimos   \n",
              "4     http://dke.jku.at/example/solarsystem/Enceladus   \n",
              "5        http://dke.jku.at/example/solarsystem/Europa   \n",
              "6      http://dke.jku.at/example/solarsystem/Ganymede   \n",
              "7            http://dke.jku.at/example/solarsystem/Io   \n",
              "8         http://dke.jku.at/example/solarsystem/Mimas   \n",
              "9          http://dke.jku.at/example/solarsystem/Moon   \n",
              "10       http://dke.jku.at/example/solarsystem/Phobos   \n",
              "11  http://dke.jku.at/example/solarsystem/ProximaC...   \n",
              "12          http://dke.jku.at/example/solarsystem/Sun   \n",
              "\n",
              "                                                y  \n",
              "0                                            None  \n",
              "1                                            None  \n",
              "2   http://dke.jku.at/example/solarsystem/Jupiter  \n",
              "3      http://dke.jku.at/example/solarsystem/Mars  \n",
              "4    http://dke.jku.at/example/solarsystem/Saturn  \n",
              "5   http://dke.jku.at/example/solarsystem/Jupiter  \n",
              "6   http://dke.jku.at/example/solarsystem/Jupiter  \n",
              "7   http://dke.jku.at/example/solarsystem/Jupiter  \n",
              "8    http://dke.jku.at/example/solarsystem/Saturn  \n",
              "9     http://dke.jku.at/example/solarsystem/Earth  \n",
              "10     http://dke.jku.at/example/solarsystem/Mars  \n",
              "11                                           None  \n",
              "12                                           None  "
            ],
            "text/html": [
              "\n",
              "  <div id=\"df-494df6b9-3dc7-4753-8b38-11b62a096e6f\">\n",
              "    <div class=\"colab-df-container\">\n",
              "      <div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>x</th>\n",
              "      <th>y</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>http://dke.jku.at/example/solarsystem/AlphaCen...</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>http://dke.jku.at/example/solarsystem/AlphaCen...</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Callisto</td>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Jupiter</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Deimos</td>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Mars</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Enceladus</td>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Saturn</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>5</th>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Europa</td>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Jupiter</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>6</th>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Ganymede</td>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Jupiter</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>7</th>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Io</td>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Jupiter</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>8</th>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Mimas</td>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Saturn</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9</th>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Moon</td>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Earth</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>10</th>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Phobos</td>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Mars</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>11</th>\n",
              "      <td>http://dke.jku.at/example/solarsystem/ProximaC...</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>12</th>\n",
              "      <td>http://dke.jku.at/example/solarsystem/Sun</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>\n",
              "      <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-494df6b9-3dc7-4753-8b38-11b62a096e6f')\"\n",
              "              title=\"Convert this dataframe to an interactive table.\"\n",
              "              style=\"display:none;\">\n",
              "        \n",
              "  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n",
              "       width=\"24px\">\n",
              "    <path d=\"M0 0h24v24H0V0z\" fill=\"none\"/>\n",
              "    <path d=\"M18.56 5.44l.94 2.06.94-2.06 2.06-.94-2.06-.94-.94-2.06-.94 2.06-2.06.94zm-11 1L8.5 8.5l.94-2.06 2.06-.94-2.06-.94L8.5 2.5l-.94 2.06-2.06.94zm10 10l.94 2.06.94-2.06 2.06-.94-2.06-.94-.94-2.06-.94 2.06-2.06.94z\"/><path d=\"M17.41 7.96l-1.37-1.37c-.4-.4-.92-.59-1.43-.59-.52 0-1.04.2-1.43.59L10.3 9.45l-7.72 7.72c-.78.78-.78 2.05 0 2.83L4 21.41c.39.39.9.59 1.41.59.51 0 1.02-.2 1.41-.59l7.78-7.78 2.81-2.81c.8-.78.8-2.07 0-2.86zM5.41 20L4 18.59l7.72-7.72 1.47 1.35L5.41 20z\"/>\n",
              "  </svg>\n",
              "      </button>\n",
              "      \n",
              "  <style>\n",
              "    .colab-df-container {\n",
              "      display:flex;\n",
              "      flex-wrap:wrap;\n",
              "      gap: 12px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert {\n",
              "      background-color: #E8F0FE;\n",
              "      border: none;\n",
              "      border-radius: 50%;\n",
              "      cursor: pointer;\n",
              "      display: none;\n",
              "      fill: #1967D2;\n",
              "      height: 32px;\n",
              "      padding: 0 0 0 0;\n",
              "      width: 32px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert:hover {\n",
              "      background-color: #E2EBFA;\n",
              "      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "      fill: #174EA6;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert {\n",
              "      background-color: #3B4455;\n",
              "      fill: #D2E3FC;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert:hover {\n",
              "      background-color: #434B5C;\n",
              "      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n",
              "      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n",
              "      fill: #FFFFFF;\n",
              "    }\n",
              "  </style>\n",
              "\n",
              "      <script>\n",
              "        const buttonEl =\n",
              "          document.querySelector('#df-494df6b9-3dc7-4753-8b38-11b62a096e6f button.colab-df-convert');\n",
              "        buttonEl.style.display =\n",
              "          google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "\n",
              "        async function convertToInteractive(key) {\n",
              "          const element = document.querySelector('#df-494df6b9-3dc7-4753-8b38-11b62a096e6f');\n",
              "          const dataTable =\n",
              "            await google.colab.kernel.invokeFunction('convertToInteractive',\n",
              "                                                     [key], {});\n",
              "          if (!dataTable) return;\n",
              "\n",
              "          const docLinkHtml = 'Like what you see? Visit the ' +\n",
              "            '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n",
              "            + ' to learn more about interactive tables.';\n",
              "          element.innerHTML = '';\n",
              "          dataTable['output_type'] = 'display_data';\n",
              "          await google.colab.output.renderOutput(dataTable, element);\n",
              "          const docLink = document.createElement('div');\n",
              "          docLink.innerHTML = docLinkHtml;\n",
              "          element.appendChild(docLink);\n",
              "        }\n",
              "      </script>\n",
              "    </div>\n",
              "  </div>\n",
              "  "
            ]
          },
          "metadata": {},
          "execution_count": 39
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "## Task 8 (1 pt)\n",
        "\n",
        "*TODO: add task description*"
      ],
      "metadata": {
        "id": "Us6tYyDHF8V_"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "Erzeugen sie mittels einer Construct-Query den angezeigten RDF-GRAPH (Expected Result). Reihenfolge ist unerheblich."
      ],
      "metadata": {
        "id": "2tzphUQVUKb5"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "# TODO: include and execute the query, display the result"
      ],
      "metadata": {
        "id": "Mij855L3F8V_"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "g2 = sparql_construct(g,\"\"\"\n",
        "base         <http://dke.jku.at/example/>\n",
        "prefix :     <http://dke.jku.at/example/solarsystem/>\n",
        "prefix v:    <http://dke.jku.at/example/examplevocabulary/>\n",
        "prefix rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
        "prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
        "prefix dbr:  <http://dbpedia.org/resource/>\n",
        "prefix dbo:  <http://dbpedia.org/ontology/>\n",
        "prefix dbd:\t <http://dbpedia.org/datatype/>\n",
        "prefix sdo:  <http://schema.org/>\n",
        "prefix wd:   <http://www.wikidata.org/entity/>\n",
        "prefix wdp:  <http://www.wikidata.org/prop/>\n",
        "prefix skos: <http://www.w3.org/2004/02/skos/core#>\n",
        "prefix unit: <http://qudt.org/vocab/unit/>\n",
        "prefix owl:  <http://www.w3.org/2002/07/owl#>\n",
        "\n",
        "CONSTRUCT { ?s a v:Himmelskoerper.\n",
        "           ?p v:wirdUmrundetVon ?s\n",
        "           }\n",
        "WHERE {\n",
        "?s v:orbits ?p.\n",
        "MINUS\n",
        "{?s a dbo:DwarfPlanet} }\"\"\")\n",
        "print(g2.serialize(format='turtle'))"
      ],
      "metadata": {
        "id": "2ZDURE4TUOuw",
        "outputId": "d9cda3cf-4708-496a-c476-90d85dcf232f",
        "colab": {
          "base_uri": "https://localhost:8080/"
        }
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "@prefix : <http://dke.jku.at/example/solarsystem/> .\n",
            "@prefix v: <http://dke.jku.at/example/examplevocabulary/> .\n",
            "\n",
            ":Sun v:wirdUmrundetVon :Earth,\n",
            "        :Jupiter,\n",
            "        :Mars,\n",
            "        :Mercury,\n",
            "        :Neptune,\n",
            "        :Saturn,\n",
            "        :Uranus,\n",
            "        :Venus .\n",
            "\n",
            ":Callisto a v:Himmelskoerper .\n",
            "\n",
            ":Deimos a v:Himmelskoerper .\n",
            "\n",
            ":Earth a v:Himmelskoerper ;\n",
            "    v:wirdUmrundetVon :Moon .\n",
            "\n",
            ":Enceladus a v:Himmelskoerper .\n",
            "\n",
            ":Europa a v:Himmelskoerper .\n",
            "\n",
            ":Ganymede a v:Himmelskoerper .\n",
            "\n",
            ":Io a v:Himmelskoerper .\n",
            "\n",
            ":Jupiter a v:Himmelskoerper ;\n",
            "    v:wirdUmrundetVon :Callisto,\n",
            "        :Europa,\n",
            "        :Ganymede,\n",
            "        :Io .\n",
            "\n",
            ":Mars a v:Himmelskoerper ;\n",
            "    v:wirdUmrundetVon :Deimos,\n",
            "        :Phobos .\n",
            "\n",
            ":Mercury a v:Himmelskoerper .\n",
            "\n",
            ":Mimas a v:Himmelskoerper .\n",
            "\n",
            ":Moon a v:Himmelskoerper .\n",
            "\n",
            ":Neptune a v:Himmelskoerper .\n",
            "\n",
            ":Phobos a v:Himmelskoerper .\n",
            "\n",
            ":Saturn a v:Himmelskoerper ;\n",
            "    v:wirdUmrundetVon :Enceladus,\n",
            "        :Mimas .\n",
            "\n",
            ":Uranus a v:Himmelskoerper .\n",
            "\n",
            ":Venus a v:Himmelskoerper .\n",
            "\n",
            "\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "## Task 9 (1 pt)\n",
        "\n",
        "*TODO: add task description*"
      ],
      "metadata": {
        "id": "IPLpuY8iF8gv"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "# TODO: include and execute the query, display the result"
      ],
      "metadata": {
        "id": "SaYpWyW0F8gw"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "## Task 10 (1 pt)\n",
        "\n",
        "*TODO: add task description*"
      ],
      "metadata": {
        "id": "vszUEtolF8qv"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "Geben Sie eine Beschreibung der Resourcen aus, die einen Durchmesser zwischen 20.000 km und 30.000 km haben."
      ],
      "metadata": {
        "id": "1_fV1gZRUV8b"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "# TODO: include and execute the query, display the result"
      ],
      "metadata": {
        "id": "t8gZYqQNF8qv"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "g2 = sparql_construct(g,\"\"\"\n",
        "base         <http://dke.jku.at/example/>\n",
        "prefix :     <http://dke.jku.at/example/solarsystem/>\n",
        "prefix v:    <http://dke.jku.at/example/examplevocabulary/>\n",
        "prefix rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
        "prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
        "prefix dbr:  <http://dbpedia.org/resource/>\n",
        "prefix dbo:  <http://dbpedia.org/ontology/>\n",
        "prefix dbd:\t <http://dbpedia.org/datatype/>\n",
        "prefix sdo:  <http://schema.org/>\n",
        "prefix wd:   <http://www.wikidata.org/entity/>\n",
        "prefix wdp:  <http://www.wikidata.org/prop/>\n",
        "prefix skos: <http://www.w3.org/2004/02/skos/core#>\n",
        "prefix unit: <http://qudt.org/vocab/unit/>\n",
        "prefix owl:  <http://www.w3.org/2002/07/owl#>\n",
        "\n",
        "DESCRIBE ?s\n",
        "WHERE { ?s v:radius [rdf:value ?x] \n",
        "FILTER (?x > 20000)\n",
        "FILTER (?x <30000)\n",
        " }\"\"\")\n",
        "print(g2.serialize(format='turtle'))"
      ],
      "metadata": {
        "id": "ukjSpvBAUZ1-",
        "outputId": "0c1aaba1-26b4-4648-9cc4-2269ce6a1b7b",
        "colab": {
          "base_uri": "https://localhost:8080/"
        }
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "@prefix : <http://dke.jku.at/example/solarsystem/> .\n",
            "@prefix dbo: <http://dbpedia.org/ontology/> .\n",
            "@prefix dbr: <http://dbpedia.org/resource/> .\n",
            "@prefix rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .\n",
            "@prefix skos: <http://www.w3.org/2004/02/skos/core#> .\n",
            "@prefix unit: <http://qudt.org/vocab/unit/> .\n",
            "@prefix v: <http://dke.jku.at/example/examplevocabulary/> .\n",
            "@prefix xsd: <http://www.w3.org/2001/XMLSchema#> .\n",
            "\n",
            ":Neptune a dbo:Planet ;\n",
            "    v:apoapsis [ v:uom unit:AU ;\n",
            "            rdf:value 30.33 ] ;\n",
            "    v:nrOfMoons 14 ;\n",
            "    v:orbitalPeriod [ v:uom unit:YR ;\n",
            "            rdf:value 164.8 ] ;\n",
            "    v:orbits :Sun ;\n",
            "    v:radius [ v:uom unit:KM ;\n",
            "            rdf:value 24622 ] ;\n",
            "    v:temperature [ v:uom unit:Deg_C ;\n",
            "            rdf:value -201 ] ;\n",
            "    skos:exactMatch dbr:Neptune .\n",
            "\n",
            ":Uranus a dbo:Planet ;\n",
            "    v:apoapsis [ v:uom unit:AU ;\n",
            "            rdf:value 20.11 ] ;\n",
            "    v:nrOfMoons 27 ;\n",
            "    v:orbitalPeriod [ v:uom unit:YR ;\n",
            "            rdf:value 84.0205 ] ;\n",
            "    v:orbits :Sun ;\n",
            "    v:radius [ v:uom unit:KM ;\n",
            "            rdf:value 25362 ] ;\n",
            "    v:temperature [ v:uom unit:Deg_C ;\n",
            "            rdf:value -197.2 ] ;\n",
            "    skos:exactMatch dbr:Uranus .\n",
            "\n",
            "\n"
          ]
        }
      ]
    }
  ]
}